backend: tensorflow
class_name: Sequential
config:
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple
      - null
      - 15
      - 1
      dtype: float32
      name: activation_28_input
      ragged: false
      sparse: false
  - class_name: Activation
    config:
      activation: relu
      dtype: float32
      name: activation_28
      trainable: true
  - class_name: LSTM
    config:
      activation: tanh
      activity_regularizer: null
      batch_input_shape: !!python/tuple
      - null
      - 15
      - 1
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dropout: 0.0
      dtype: float32
      go_backwards: false
      implementation: 2
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: lstm_28
      recurrent_activation: sigmoid
      recurrent_constraint: null
      recurrent_dropout: 0.0
      recurrent_initializer:
        class_name: Orthogonal
        config:
          gain: 1.0
          seed: null
      recurrent_regularizer: null
      return_sequences: true
      return_state: false
      stateful: false
      time_major: false
      trainable: true
      unit_forget_bias: true
      units: 128
      unroll: false
      use_bias: true
  - class_name: Dense
    config:
      activation: linear
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      dtype: float32
      kernel_constraint: null
      kernel_initializer:
        class_name: GlorotUniform
        config:
          seed: null
      kernel_regularizer: null
      name: dense_142
      trainable: true
      units: 1
      use_bias: true
  name: sequential_66
keras_version: 2.4.0
